
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["atc-router"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"e93d671787e3905ff80c224d12cf4094350ea46bce9c363ed0da665b3369e87d\"" -> "W/\"1c066a6d99db771044783b63eaf79a0ddb86565473bfd3a757f02bedf8c02e80\""
        id                          = "atc-router"
        name                        = "atc-router"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"13f6301588eb23a3e5539ad62488853aeb8e6b75105353dbd279435f1a85097f\"" -> "W/\"245c9b198bdda3a62fa9eec1c6121488b4af6863df10100a8156fcda8c8a9e4b\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"4171bf2b2cff853cf6febabd3cbc57e01c254e1e3dbab9c7e9a2cbfafb00e7a4\"" -> "W/\"037c6280bf254c94661b329b47eabe30650aec550e44b0d48d1e557160cecd43\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-package"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"708ea351cc4c713bb23235d88864dc0c6de8243a4638508f1e288c10addb5670\"" -> "W/\"a15e9481ada308f7c02eb2bc7a137b85857e0c71c89b174ea8d0bb4352d27b7d\""
        id                          = "kong-package"
        name                        = "kong-package"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"a68e09ec81782f3b6029ea5b84163ae8d4d77b695d653c658a2862d3e4f944cd\"" -> "W/\"0350194458e873b8e3886812644e00cb170aeea5b4fb55df109f675c811178f7\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-test-suite"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"19a43b1d14848ea0d6387c3c311412f5f25854a55ecaafad33cd26524ced3538\"" -> "W/\"04a975517ea146edee7c3f66736a403dfc398ae08354282903ccc93e091eb649\""
        id                          = "kong-test-suite"
        name                        = "kong-test-suite"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["multi-arch-fpm"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"be655e81738c26f498b84c8bf779153a798b804c2a2a998bce1f9b7e66561df2\"" -> "W/\"89a8d9036e279c4c852a25e68166fe2b690a911ef7e9e614814d4f08b807b41a\""
        id                          = "multi-arch-fpm"
        name                        = "multi-arch-fpm"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"d1286919fef534d3bdbbfc37e9e4940174fb5fc25bd24589fcc83c818e823a81\"" -> "W/\"f6d7646300d2dee974de9afb4480b3cd565d31ad518d0b4daa498498f9af1ab7\""
        id                          = "template-template"
        name                        = "template-template"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"aa0bda11afef8688f07c8143adab19ff6da606fb0ece70a39db8ddac2f047b7e\"" -> "W/\"f68f0edd87ff93d4c580afa827525aff8b10d691aff3a980e4938d7a3dac840a\""
        id          = "1481994"
        name        = "protect-main-branch-atc-router-pre-commit-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"bf1d35417aab75db09c2191119aaf33d40b31d7025e6b4e6072d822baa369e18\"" -> "W/\"8f9ac57e6e2651f8844be180e96afc35c859312b28fb802b6c606dfcd0056b65\""
        id          = "1430804"
        name        = "protect-main-branch-kong-build-images-pre-commit-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"56608a918d239553d88f8e1820e9cedd8cea7eec56f275db51135103aa69a082\"" -> "W/\"bc00c331759263910d37643d82f88d0f04da5db864960b13a39365e391fa228d\""
        id          = "1430806"
        name        = "protect-main-branch-kong-development-pre-commit-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"5c1e05bf101a4f65425cfc1c9df352b862779bc503d06d3e1e7e09ea5d5b87a8\"" -> "W/\"7edb3a68ecc76bdd6e86ed9e1b08728e31ab8b9b047a1494b4bd0f6f91125a44\""
        id          = "1430805"
        name        = "protect-main-branch-kong-openssl-pre-commit-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"7b76f89565afbd4d941b60a226872a52c77e9499fa7e58ebaeaa306da8b308a8\"" -> "W/\"5ade42a26fb2a529c822b591dbc9ae70222387ec862deba2f88703bf9d727ca7\""
        id          = "1430802"
        name        = "protect-main-branch-kong-package-pre-commit-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"f5f826d538068f94524dba62bde339dd01c854c8435a73adbb5c9005ea113d7d\"" -> "W/\"1a3274bdc89c54c05e715b21fa806f1e5fdb97ba8fa99ae4a2c4e280064f08f1\""
        id          = "1430818"
        name        = "protect-main-branch-kong-runtime-pre-commit-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"8571068da4dee8498ea12e84f35fd6720dd461fb59ae2746d0b7c005964ef3b8\"" -> "W/\"3c9c9158cf50f7af737c8d55381fced13fc58f672264c3c16e93d498fd024509\""
        id          = "1430817"
        name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"d9d6912651c12d19f12fdf59a0411cf1e2845965bf20a4150b534f8883636adf\"" -> "W/\"fb1db98d4ac97cf1a0478da5b1e455f8df6878a89c08c93e1289d50099ee2b4d\""
        id          = "1430803"
        name        = "protect-main-branch-template-1-github-release-pre-commit-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"22c4481477c005821f98207396d14fc93158645ecd2e77efcf0a32fed7689ee8\"" -> "W/\"f95dde4671bcd60be05be8be039231a7a6a1776ea1c0e1559a6dce38cc1b123f\""
        id          = "1430814"
        name        = "protect-main-branch-template-1-terraform-pre-commit-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"863d5d7816966291924e2635730c6becb58e4b5d01822b566b8cb6e2cae70be3\"" -> "W/\"516c5e0e46e9d78a270e25ac45332b50b78f28fa08e44d8521242cbdd75498f4\""
        id          = "1430815"
        name        = "protect-main-branch-template-template-pre-commit-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"6bea5fcd6916582b991c55bfeb2f0af881d4d21c9a9471e294717497fd7afa11\"" -> "W/\"c5b1b9dd38c2265b6025bf195862b5f008a1ea42d59c77a62950840b1ad94a46\""
        id          = "1430807"
        name        = "protect-main-branch-terraform-github-pre-commit-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"1ab676955703aad7bb51a29e8b2412df409dc99468235ea09f9d5178463aef65\"" -> "W/\"b5b76f754d4fe521bc89deac0e79220a39ea7b9a3d3c854c26c235c3d5c3578b\""
        id          = "1430869"
        name        = "protect-main-branch-kong-build-images-release-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"982f8e61694b7566e56a20be9910f112dffae09f49951b9da18508b3ae909d96\"" -> "W/\"48f0a95c8063ff0182d5f02ccc634ac3ba83aed5cc2eec6a29f4f6fe0b650e5d\""
        id          = "1430871"
        name        = "protect-main-branch-kong-development-release-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"dec526d2d00b4d12f2921741186d39a2ba4a9951c91ddb6d27ba83c01c8ca226\"" -> "W/\"24c8ef628ae9e45b7f32259594f2bd0de31971ad1d0a54340e5843b900fcc599\""
        id          = "1430870"
        name        = "protect-main-branch-kong-openssl-release-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"a6e9f7bf35347b06ca083e7efb2b30929de05a37faec6d442638ec08b04af66a\"" -> "W/\"b928f2d5ddcd949c002d79adc5ef73fad8396183b1ff25349dd0c15ffda50d84\""
        id          = "1430873"
        name        = "protect-main-branch-kong-package-release-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"b4114329af01bfa9701e362fe8e8d8f193c0bac4b066212408018299b686384c\"" -> "W/\"f06b4575cdd5e4d7384d8d341b594d64f3847a899861a298dcb1b338b72275f4\""
        id          = "1430868"
        name        = "protect-main-branch-kong-runtime-release-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"d0e1d2a79bd5d4d6b7a110515ee74e288df53451655d06fa6cac32e4190b3046\"" -> "W/\"0b6bcf287e4b023d64cd81a2bad8977b72e00625f2fa246446e63cfb0a237893\""
        id          = "1430872"
        name        = "protect-main-branch-multi-arch-fpm-release-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"397013eb785e36355433a6c4a97d6f2ea2968c8a4298539b605461802ce1f531\"" -> "W/\"1b881e39e042179515455528bc470a909f6b1670d962dbd3fb817dc4a4f11895\""
        id          = "1431038"
        name        = "protect-main-branch-template-1-github-release-release-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"07ece79936044b2a91124827ac1f65df834dc16889f2bd6e1f78f99cb6f2aa87\"" -> "W/\"4cbd6e8ec3dc11a280c702436a05ddff5db090ec4058b91c53bfa879820abd24\""
        id          = "1430865"
        name        = "protect-main-branch-template-1-terraform-terraform-plan-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"fa1cfa2dfe1161d26e86edb7688115d3d6550df2e8ba8440891edfd7d00f7eef\"" -> "W/\"14aa2c8c4787c4ab85dfc596708e574c61f8f9cb6f78e236cb3a581ddb2e5033\""
        id          = "1430864"
        name        = "protect-main-branch-terraform-github-terraform-plan-20240822-060805"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.settings_all["kong-test-suite"] will be updated in-place
  ~ resource "github_repository" "settings_all" {
        id                          = "kong-test-suite"
        name                        = "kong-test-suite"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1481994"
      ~ name        = "protect-main-branch-atc-router-pre-commit-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430804"
      ~ name        = "protect-main-branch-kong-build-images-pre-commit-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430806"
      ~ name        = "protect-main-branch-kong-development-pre-commit-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430805"
      ~ name        = "protect-main-branch-kong-openssl-pre-commit-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430802"
      ~ name        = "protect-main-branch-kong-package-pre-commit-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430818"
      ~ name        = "protect-main-branch-kong-runtime-pre-commit-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-test-suite"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430817"
      ~ name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430803"
      ~ name        = "protect-main-branch-template-1-github-release-pre-commit-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430814"
      ~ name        = "protect-main-branch-template-1-terraform-pre-commit-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430815"
      ~ name        = "protect-main-branch-template-template-pre-commit-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430807"
      ~ name        = "protect-main-branch-terraform-github-pre-commit-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430869"
      ~ name        = "protect-main-branch-kong-build-images-release-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430871"
      ~ name        = "protect-main-branch-kong-development-release-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430870"
      ~ name        = "protect-main-branch-kong-openssl-release-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430873"
      ~ name        = "protect-main-branch-kong-package-release-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430868"
      ~ name        = "protect-main-branch-kong-runtime-release-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-test-suite"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "Done"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430872"
      ~ name        = "protect-main-branch-multi-arch-fpm-release-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1431038"
      ~ name        = "protect-main-branch-template-1-github-release-release-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430865"
      ~ name        = "protect-main-branch-template-1-terraform-terraform-plan-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430864"
      ~ name        = "protect-main-branch-terraform-github-terraform-plan-20240822-060805" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 21 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->